# Object Creation
Creation of Series and DataFrames

In [0]:
import numpy as np
import pandas as pd

s = pd.Series([5, 2, np.nan, 8, 3])

s

0    5.0
1    2.0
2    NaN
3    8.0
4    3.0
dtype: float64

In [0]:
dates = pd.date_range("20130101", periods=12, freq="M")

df = pd.DataFrame(np.random.randn(12, 4), index=dates, columns=list("ABCD"))

df

                   A         B         C         D
2013-01-31  0.708013 -0.004502  0.441911  0.945155
2013-02-28  0.072095  1.616562 -0.347967 -0.337045
2013-03-31  0.667359  1.392938  2.455543 -0.291956
2013-04-30  1.749657 -0.749766 -0.652762  2.050782
2013-05-31  0.957102  0.192933  0.321934  0.520162
2013-06-30  0.024835  0.746146  0.856928 -0.628672
2013-07-31  2.668856 -0.519759 -1.396908 -0.226528
2013-08-31  0.664134  1.488608  0.875024  0.384178
2013-09-30 -0.195505 -0.972930 -0.079203  1.039312
2013-10-31 -0.638550 -1.063592 -0.328096  0.738510
2013-11-30 -1.030374  0.425851  0.168814  0.106634
2013-12-31  0.161653 -0.843938  0.311525  0.136695

In [0]:
df_dic = pd.DataFrame({
    "A": 1.,
    "B": pd.Timestamp("20130201"),
    "C": pd.Series(1, index=list(range(4))),
    "D": np.array([3] * 4, dtype="int32"),
    "E": pd.Categorical(["test", "train", "test", "train"]),
    "F": "foo"
})

df_dic

     A          B  C  D      E    F
0  1.0 2013-02-01  1  3   test  foo
1  1.0 2013-02-01  1  3  train  foo
2  1.0 2013-02-01  1  3   test  foo
3  1.0 2013-02-01  1  3  train  foo

In [0]:
#Columns of the resulting DataFrame "df_dic" have different dtypes
df_dic.dtypes

A           float64
B    datetime64[ns]
C             int64
D             int32
E          category
F            object
dtype: object

Data Visualization

In [0]:
#First 5 rows of data
df.head()

                   A         B         C         D
2013-01-31  0.708013 -0.004502  0.441911  0.945155
2013-02-28  0.072095  1.616562 -0.347967 -0.337045
2013-03-31  0.667359  1.392938  2.455543 -0.291956
2013-04-30  1.749657 -0.749766 -0.652762  2.050782
2013-05-31  0.957102  0.192933  0.321934  0.520162

In [0]:
#Last 3 rows of data
df.tail(3)

                   A         B         C         D
2013-10-31 -0.638550 -1.063592 -0.328096  0.738510
2013-11-30 -1.030374  0.425851  0.168814  0.106634
2013-12-31  0.161653 -0.843938  0.311525  0.136695

In [0]:
#Display the index
df.index

DatetimeIndex(['2013-01-31', '2013-02-28', '2013-03-31', '2013-04-30',
               '2013-05-31', '2013-06-30', '2013-07-31', '2013-08-31',
               '2013-09-30', '2013-10-31', '2013-11-30', '2013-12-31'],
              dtype='datetime64[ns]', freq='M')

In [0]:
#Display the columns
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [0]:
#Pandas->NumPy
#df items are the same dtypes so its cheap function
df.to_numpy()

array([[ 0.7080128 , -0.00450243,  0.44191147,  0.94515497],
       [ 0.07209498,  1.6165618 , -0.34796657, -0.33704461],
       [ 0.66735929,  1.39293792,  2.45554341, -0.29195596],
       [ 1.74965726, -0.7497656 , -0.65276181,  2.05078248],
       [ 0.95710247,  0.19293332,  0.32193366,  0.52016191],
       [ 0.02483453,  0.74614604,  0.85692765, -0.62867213],
       [ 2.66885626, -0.51975916, -1.39690775, -0.22652761],
       [ 0.6641335 ,  1.48860792,  0.87502421,  0.3841781 ],
       [-0.19550501, -0.97293036, -0.07920266,  1.03931242],
       [-0.63855003, -1.06359227, -0.32809586,  0.73850983],
       [-1.03037375,  0.42585144,  0.16881396,  0.10663382],
       [ 0.16165272, -0.84393787,  0.31152542,  0.13669524]])

In [0]:
#df_dic items don't have the same dtypes so the function is EXPENSIVE
#as it has to convert them to dtype object
df_dic.to_numpy()

array([[1.0, Timestamp('2013-02-01 00:00:00'), 1, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-02-01 00:00:00'), 1, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-02-01 00:00:00'), 1, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-02-01 00:00:00'), 1, 3, 'train', 'foo']],
      dtype=object)

In [0]:
#describe() shows quick statistic summary of the data
df.describe()

               A          B          C          D
count  12.000000  12.000000  12.000000  12.000000
mean    0.484106   0.142379   0.218895   0.369769
std     1.009732   0.996536   0.953063   0.749390
min    -1.030374  -1.063592  -1.396908  -0.628672
25%    -0.030250  -0.773309  -0.333064  -0.242885
50%     0.412893   0.094215   0.240170   0.260437
75%     0.770285   0.907844   0.545666   0.790171
max     2.668856   1.616562   2.455543   2.050782

In [0]:
#Transpose DataFrame
df.T

   2013-01-31  2013-02-28  2013-03-31  ...  2013-10-31  2013-11-30  2013-12-31
A    0.708013    0.072095    0.667359  ...   -0.638550   -1.030374    0.161653
B   -0.004502    1.616562    1.392938  ...   -1.063592    0.425851   -0.843938
C    0.441911   -0.347967    2.455543  ...   -0.328096    0.168814    0.311525
D    0.945155   -0.337045   -0.291956  ...    0.738510    0.106634    0.136695

[4 rows x 12 columns]

In [0]:
#Sorting by axis
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-31  0.945155  0.441911 -0.004502  0.708013
2013-02-28 -0.337045 -0.347967  1.616562  0.072095
2013-03-31 -0.291956  2.455543  1.392938  0.667359
2013-04-30  2.050782 -0.652762 -0.749766  1.749657
2013-05-31  0.520162  0.321934  0.192933  0.957102
2013-06-30 -0.628672  0.856928  0.746146  0.024835
2013-07-31 -0.226528 -1.396908 -0.519759  2.668856
2013-08-31  0.384178  0.875024  1.488608  0.664134
2013-09-30  1.039312 -0.079203 -0.972930 -0.195505
2013-10-31  0.738510 -0.328096 -1.063592 -0.638550
2013-11-30  0.106634  0.168814  0.425851 -1.030374
2013-12-31  0.136695  0.311525 -0.843938  0.161653

In [0]:
#Sorting by values
df.sort_values(by="B")

                   A         B         C         D
2013-10-31 -0.638550 -1.063592 -0.328096  0.738510
2013-09-30 -0.195505 -0.972930 -0.079203  1.039312
2013-12-31  0.161653 -0.843938  0.311525  0.136695
2013-04-30  1.749657 -0.749766 -0.652762  2.050782
2013-07-31  2.668856 -0.519759 -1.396908 -0.226528
2013-01-31  0.708013 -0.004502  0.441911  0.945155
2013-05-31  0.957102  0.192933  0.321934  0.520162
2013-11-30 -1.030374  0.425851  0.168814  0.106634
2013-06-30  0.024835  0.746146  0.856928 -0.628672
2013-03-31  0.667359  1.392938  2.455543 -0.291956
2013-08-31  0.664134  1.488608  0.875024  0.384178
2013-02-28  0.072095  1.616562 -0.347967 -0.337045

# Selection
Selecting data from DataFrames

## Getting

In [0]:
#Selecting a single column yields a Series equivalent to df.A
df["A"]

2013-01-31    0.708013
2013-02-28    0.072095
2013-03-31    0.667359
2013-04-30    1.749657
2013-05-31    0.957102
2013-06-30    0.024835
2013-07-31    2.668856
2013-08-31    0.664134
2013-09-30   -0.195505
2013-10-31   -0.638550
2013-11-30   -1.030374
2013-12-31    0.161653
Freq: M, Name: A, dtype: float64

In [0]:
#Slicing rows
df[0:3]

                   A         B         C         D
2013-01-31  0.708013 -0.004502  0.441911  0.945155
2013-02-28  0.072095  1.616562 -0.347967 -0.337045
2013-03-31  0.667359  1.392938  2.455543 -0.291956

## Selection by label

In [0]:
df.loc[dates[0]]

A    0.708013
B   -0.004502
C    0.441911
D    0.945155
Name: 2013-01-31 00:00:00, dtype: float64

In [0]:
#Multi-axis label selection
df.loc[:, ["A", "B"]]

                   A         B
2013-01-31  0.708013 -0.004502
2013-02-28  0.072095  1.616562
2013-03-31  0.667359  1.392938
2013-04-30  1.749657 -0.749766
2013-05-31  0.957102  0.192933
2013-06-30  0.024835  0.746146
2013-07-31  2.668856 -0.519759
2013-08-31  0.664134  1.488608
2013-09-30 -0.195505 -0.972930
2013-10-31 -0.638550 -1.063592
2013-11-30 -1.030374  0.425851
2013-12-31  0.161653 -0.843938

In [0]:
df.loc["20130201":"20130501", ["A", "B"]]

                   A         B
2013-02-28  0.072095  1.616562
2013-03-31  0.667359  1.392938
2013-04-30  1.749657 -0.749766

In [0]:
#Getting specific data point(scalar)
df.loc[dates[0], "A"]

0.7080128039393773

In [0]:
#Fast access to scalar (equivalent to the previous method)
df.at[dates[0], "A"]

0.7080128039393773

## Selection by position

In [0]:
#Select via the position of the passed integers (position in Series)
df.iloc[3]

A    1.749657
B   -0.749766
C   -0.652762
D    2.050782
Name: 2013-04-30 00:00:00, dtype: float64

In [0]:
df.iloc[3:5, 0:2]

                   A         B
2013-04-30  1.749657 -0.749766
2013-05-31  0.957102  0.192933

In [0]:
#Array-like positions
df.iloc[[1, 2, 4], [0, 2]]

                   A         C
2013-02-28  0.072095 -0.347967
2013-03-31  0.667359  2.455543
2013-05-31  0.957102  0.321934

In [0]:
#Slicing specific rows
df.iloc[1:3, :]

                   A         B         C         D
2013-02-28  0.072095  1.616562 -0.347967 -0.337045
2013-03-31  0.667359  1.392938  2.455543 -0.291956

In [0]:
#Slicing specific columns
df.iloc[:, 1:3]

                   B         C
2013-01-31 -0.004502  0.441911
2013-02-28  1.616562 -0.347967
2013-03-31  1.392938  2.455543
2013-04-30 -0.749766 -0.652762
2013-05-31  0.192933  0.321934
2013-06-30  0.746146  0.856928
2013-07-31 -0.519759 -1.396908
2013-08-31  1.488608  0.875024
2013-09-30 -0.972930 -0.079203
2013-10-31 -1.063592 -0.328096
2013-11-30  0.425851  0.168814
2013-12-31 -0.843938  0.311525

In [0]:
#Specific value
df.iloc[1, 1]

1.616561796297109

In [0]:
#Fast access
df.iat[1, 1]

1.616561796297109

## Boolean indexing

In [0]:
#Using a single column's values to select data
df[df.A > 0] #Only positive integers in A

                   A         B         C         D
2013-01-31  0.708013 -0.004502  0.441911  0.945155
2013-02-28  0.072095  1.616562 -0.347967 -0.337045
2013-03-31  0.667359  1.392938  2.455543 -0.291956
2013-04-30  1.749657 -0.749766 -0.652762  2.050782
2013-05-31  0.957102  0.192933  0.321934  0.520162
2013-06-30  0.024835  0.746146  0.856928 -0.628672
2013-07-31  2.668856 -0.519759 -1.396908 -0.226528
2013-08-31  0.664134  1.488608  0.875024  0.384178
2013-12-31  0.161653 -0.843938  0.311525  0.136695

In [0]:
df[df > 0]

                   A         B         C         D
2013-01-31  0.708013       NaN  0.441911  0.945155
2013-02-28  0.072095  1.616562       NaN       NaN
2013-03-31  0.667359  1.392938  2.455543       NaN
2013-04-30  1.749657       NaN       NaN  2.050782
2013-05-31  0.957102  0.192933  0.321934  0.520162
2013-06-30  0.024835  0.746146  0.856928       NaN
2013-07-31  2.668856       NaN       NaN       NaN
2013-08-31  0.664134  1.488608  0.875024  0.384178
2013-09-30       NaN       NaN       NaN  1.039312
2013-10-31       NaN       NaN       NaN  0.738510
2013-11-30       NaN  0.425851  0.168814  0.106634
2013-12-31  0.161653       NaN  0.311525  0.136695

In [0]:
#Using isin() for filtering
df2 = df.copy()
df2["E"] = ["one", "two", "three", "four", "three", "six", "five", "eight" , "nine", "one", "one", "one"]
print(df2)
df[df2["E"].isin(["two", "four"])]

                   A         B         C         D      E
2013-01-31  0.708013 -0.004502  0.441911  0.945155    one
2013-02-28  0.072095  1.616562 -0.347967 -0.337045    two
2013-03-31  0.667359  1.392938  2.455543 -0.291956  three
2013-04-30  1.749657 -0.749766 -0.652762  2.050782   four
2013-05-31  0.957102  0.192933  0.321934  0.520162  three
2013-06-30  0.024835  0.746146  0.856928 -0.628672    six
2013-07-31  2.668856 -0.519759 -1.396908 -0.226528   five
2013-08-31  0.664134  1.488608  0.875024  0.384178  eight
2013-09-30 -0.195505 -0.972930 -0.079203  1.039312   nine
2013-10-31 -0.638550 -1.063592 -0.328096  0.738510    one
2013-11-30 -1.030374  0.425851  0.168814  0.106634    one
2013-12-31  0.161653 -0.843938  0.311525  0.136695    one

                   A         B         C         D
2013-02-28  0.072095  1.616562 -0.347967 -0.337045
2013-04-30  1.749657 -0.749766 -0.652762  2.050782

## Setting

In [0]:
#Setting a new column automatically aligns the data by the indexes
s1 = pd.Series([1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12], index=dates)
s1

2013-01-31     1
2013-02-28     2
2013-03-31     3
2013-04-30     4
2013-05-31     5
2013-06-30     6
2013-07-31     7
2013-08-31     8
2013-09-30     9
2013-10-31    10
2013-11-30    11
2013-12-31    12
Freq: M, dtype: int64

In [0]:
df["F"] = s1
df

                   A         B         C         D   F
2013-01-31  0.708013 -0.004502  0.441911  0.945155   1
2013-02-28  0.072095  1.616562 -0.347967 -0.337045   2
2013-03-31  0.667359  1.392938  2.455543 -0.291956   3
2013-04-30  1.749657 -0.749766 -0.652762  2.050782   4
2013-05-31  0.957102  0.192933  0.321934  0.520162   5
2013-06-30  0.024835  0.746146  0.856928 -0.628672   6
2013-07-31  2.668856 -0.519759 -1.396908 -0.226528   7
2013-08-31  0.664134  1.488608  0.875024  0.384178   8
2013-09-30 -0.195505 -0.972930 -0.079203  1.039312   9
2013-10-31 -0.638550 -1.063592 -0.328096  0.738510  10
2013-11-30 -1.030374  0.425851  0.168814  0.106634  11
2013-12-31  0.161653 -0.843938  0.311525  0.136695  12

In [0]:
#Setting by assigning with a NumPy array
df.loc[:, "D"] = np.array([5] * len(df))
df

                   A         B         C  D   F
2013-01-31  0.708013 -0.004502  0.441911  5   1
2013-02-28  0.072095  1.616562 -0.347967  5   2
2013-03-31  0.667359  1.392938  2.455543  5   3
2013-04-30  1.749657 -0.749766 -0.652762  5   4
2013-05-31  0.957102  0.192933  0.321934  5   5
2013-06-30  0.024835  0.746146  0.856928  5   6
2013-07-31  2.668856 -0.519759 -1.396908  5   7
2013-08-31  0.664134  1.488608  0.875024  5   8
2013-09-30 -0.195505 -0.972930 -0.079203  5   9
2013-10-31 -0.638550 -1.063592 -0.328096  5  10
2013-11-30 -1.030374  0.425851  0.168814  5  11
2013-12-31  0.161653 -0.843938  0.311525  5  12

In [0]:
#A where operation with setting (negation)
df2 = df.copy()
df2[df2 > 0] = -df2
df2

                   A         B         C  D   F
2013-01-31 -0.708013 -0.004502 -0.441911 -5  -1
2013-02-28 -0.072095 -1.616562 -0.347967 -5  -2
2013-03-31 -0.667359 -1.392938 -2.455543 -5  -3
2013-04-30 -1.749657 -0.749766 -0.652762 -5  -4
2013-05-31 -0.957102 -0.192933 -0.321934 -5  -5
2013-06-30 -0.024835 -0.746146 -0.856928 -5  -6
2013-07-31 -2.668856 -0.519759 -1.396908 -5  -7
2013-08-31 -0.664134 -1.488608 -0.875024 -5  -8
2013-09-30 -0.195505 -0.972930 -0.079203 -5  -9
2013-10-31 -0.638550 -1.063592 -0.328096 -5 -10
2013-11-30 -1.030374 -0.425851 -0.168814 -5 -11
2013-12-31 -0.161653 -0.843938 -0.311525 -5 -12

# Missing Data
Panda uses np.nan to represent missing data. It is by default not included in computations.

In [0]:
#Reindexing allows you to change/add/delete the index on a specified axis.
#This returns a copy of the DataFrame
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ["E"])

df1.loc[dates[0]:dates[1], "E"] = 1

df1

                   A         B         C  D  F    E
2013-01-31  0.708013 -0.004502  0.441911  5  1  1.0
2013-02-28  0.072095  1.616562 -0.347967  5  2  1.0
2013-03-31  0.667359  1.392938  2.455543  5  3  NaN
2013-04-30  1.749657 -0.749766 -0.652762  5  4  NaN

In [0]:
#To drop any rows that have missing data

df1.dropna(how="any")

                   A         B         C  D  F    E
2013-01-31  0.708013 -0.004502  0.441911  5  1  1.0
2013-02-28  0.072095  1.616562 -0.347967  5  2  1.0

In [0]:
#Filling missing data

df1.fillna(value=5)

                   A         B         C  D  F    E
2013-01-31  0.708013 -0.004502  0.441911  5  1  1.0
2013-02-28  0.072095  1.616562 -0.347967  5  2  1.0
2013-03-31  0.667359  1.392938  2.455543  5  3  5.0
2013-04-30  1.749657 -0.749766 -0.652762  5  4  5.0

In [0]:
#To get the boolean mask where values are nan
pd.isna(df1)

                A      B      C      D      F      E
2013-01-31  False  False  False  False  False  False
2013-02-28  False  False  False  False  False  False
2013-03-31  False  False  False  False  False   True
2013-04-30  False  False  False  False  False   True

# Operations
Operations exclude missing data (nan values)

In [0]:
df.mean()

A    0.484106
B    0.142379
C    0.218895
D    5.000000
F    6.500000
dtype: float64

In [0]:
df.mean(1)

2013-01-31    1.429084
2013-02-28    1.668138
2013-03-31    2.503168
2013-04-30    1.869426
2013-05-31    2.294394
2013-06-30    2.525582
2013-07-31    2.550438
2013-08-31    3.205553
2013-09-30    2.550472
2013-10-31    2.593952
2013-11-30    3.112858
2013-12-31    3.325848
Freq: M, dtype: float64

In [0]:
s = pd.Series([1, 3, 5, np.nan, 6, 8, 1, 2, 3, 4, 5, 6], index=dates).shift(2)

s

2013-01-31    NaN
2013-02-28    NaN
2013-03-31    1.0
2013-04-30    3.0
2013-05-31    5.0
2013-06-30    NaN
2013-07-31    6.0
2013-08-31    8.0
2013-09-30    1.0
2013-10-31    2.0
2013-11-30    3.0
2013-12-31    4.0
Freq: M, dtype: float64

In [0]:
df.sub(s, axis="index")

                   A         B         C    D    F
2013-01-31       NaN       NaN       NaN  NaN  NaN
2013-02-28       NaN       NaN       NaN  NaN  NaN
2013-03-31 -0.332641  0.392938  1.455543  4.0  2.0
2013-04-30 -1.250343 -3.749766 -3.652762  2.0  1.0
2013-05-31 -4.042898 -4.807067 -4.678066  0.0  0.0
2013-06-30       NaN       NaN       NaN  NaN  NaN
2013-07-31 -3.331144 -6.519759 -7.396908 -1.0  1.0
2013-08-31 -7.335866 -6.511392 -7.124976 -3.0  0.0
2013-09-30 -1.195505 -1.972930 -1.079203  4.0  8.0
2013-10-31 -2.638550 -3.063592 -2.328096  3.0  8.0
2013-11-30 -4.030374 -2.574149 -2.831186  2.0  8.0
2013-12-31 -3.838347 -4.843938 -3.688475  1.0  8.0

## Apply

In [0]:
df.apply(np.cumsum)

                   A         B         C   D   F
2013-01-31  0.708013 -0.004502  0.441911   5   1
2013-02-28  0.780108  1.612059  0.093945  10   3
2013-03-31  1.447467  3.004997  2.549488  15   6
2013-04-30  3.197124  2.255232  1.896726  20  10
2013-05-31  4.154227  2.448165  2.218660  25  15
2013-06-30  4.179061  3.194311  3.075588  30  21
2013-07-31  6.847918  2.674552  1.678680  35  28
2013-08-31  7.512051  4.163160  2.553704  40  36
2013-09-30  7.316546  3.190229  2.474502  45  45
2013-10-31  6.677996  2.126637  2.146406  50  55
2013-11-30  5.647622  2.552489  2.315220  55  66
2013-12-31  5.809275  1.708551  2.626745  60  78

In [0]:
df.apply(lambda x: x.max() - x.min())

A     3.699230
B     2.680154
C     3.852451
D     0.000000
F    11.000000
dtype: float64

## Histogramming

In [0]:
s = pd.Series(np.random.randint(0, 7, size=10))

s

0    0
1    1
2    5
3    4
4    6
5    4
6    2
7    3
8    4
9    3
dtype: int64

In [0]:
s.value_counts()

4    3
3    2
6    1
5    1
2    1
1    1
0    1
dtype: int64

## String Methods

In [0]:
s = pd.Series(["A", "B", "C", "Aaba", "Baca", np.nan, "CABA", "dog", "cat"])

s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

# Merging

## Concat

In [0]:
df = pd.DataFrame(np.random.randn(10, 4))
df

          0         1         2         3
0  0.403484  0.515441 -0.992722 -2.609672
1 -1.398088  0.397657 -0.551187 -2.493898
2  0.204626  1.458532 -0.300470 -0.952265
3 -0.301223  0.257131  1.241459  0.386363
4 -0.194314  0.254605  0.514915 -0.359181
5 -0.627234 -1.050801  1.124745  0.077489
6  0.241969  1.230702 -0.452065 -0.907739
7 -0.907871 -1.731387 -0.046724  1.678696
8 -0.800211 -0.232825  0.005555  0.307398
9 -0.222369  1.711835 -3.187900  0.363910

In [0]:
#break it into pieces
pieces = [df[:3], df[3:7], df[7:]]
pieces

[          0         1         2         3
 0  0.403484  0.515441 -0.992722 -2.609672
 1 -1.398088  0.397657 -0.551187 -2.493898
 2  0.204626  1.458532 -0.300470 -0.952265,
           0         1         2         3
 3 -0.301223  0.257131  1.241459  0.386363
 4 -0.194314  0.254605  0.514915 -0.359181
 5 -0.627234 -1.050801  1.124745  0.077489
 6  0.241969  1.230702 -0.452065 -0.907739,
           0         1         2         3
 7 -0.907871 -1.731387 -0.046724  1.678696
 8 -0.800211 -0.232825  0.005555  0.307398
 9 -0.222369  1.711835 -3.187900  0.363910]

In [0]:
#Concat the pieces
pd.concat(pieces)

          0         1         2         3
0  0.403484  0.515441 -0.992722 -2.609672
1 -1.398088  0.397657 -0.551187 -2.493898
2  0.204626  1.458532 -0.300470 -0.952265
3 -0.301223  0.257131  1.241459  0.386363
4 -0.194314  0.254605  0.514915 -0.359181
5 -0.627234 -1.050801  1.124745  0.077489
6  0.241969  1.230702 -0.452065 -0.907739
7 -0.907871 -1.731387 -0.046724  1.678696
8 -0.800211 -0.232825  0.005555  0.307398
9 -0.222369  1.711835 -3.187900  0.363910

## Join

In [0]:
#SQL style merges
left = pd.DataFrame({"key": ["foo", "foo"], "lval": [1, 2]})
right = pd.DataFrame({"key": ["foo", "foo"], "lval": [4, 5]})

print(left)
print(right)

pd.merge(left, right, on="key")

   key  lval
0  foo     1
1  foo     2
   key  lval
0  foo     4
1  foo     5

   key  lval_x  lval_y
0  foo       1       4
1  foo       1       5
2  foo       2       4
3  foo       2       5

In [0]:
#Another example
left = pd.DataFrame({"key": ["foo", "foo"], "lval": [1, 2]})
right = pd.DataFrame({"key": ["foo", "foo"], "rval": [4, 5]})

print(left)
print(right)

pd.merge(left, right, on="key")

   key  lval
0  foo     1
1  foo     2
   key  rval
0  foo     4
1  foo     5

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

## Append

In [0]:
#Append rows to a DataFrame

df = pd.DataFrame(np.random.randn(8, 4), columns=list("ABCD"))

s = df.iloc[3]

df.append(s, ignore_index=True)

          A         B         C         D
0 -1.797692 -0.489498  1.454718 -0.059405
1  1.470915 -0.666544 -0.807360  0.454401
2  0.302394  0.145382 -0.211988 -0.297299
3 -0.959213  0.151393 -0.240464 -0.756647
4 -1.262000 -0.491174 -0.909896  1.332070
5 -0.478503  1.230118 -0.199850 -0.214810
6 -0.449647  1.551120 -0.340804  1.153168
7 -0.408757 -0.688188  0.471903  0.118802
8 -0.959213  0.151393 -0.240464 -0.756647

# Grouping
By “group by” we are referring to a process involving one or more of the following steps:

*   Splitting the data into groups based on some criteria
*   Applying a function to each group independently

*   Combining the results into a data structure

In [0]:
df = pd.DataFrame({'A': ['foo', 'bar', 'foo', 'bar',
                        'foo', 'bar', 'foo', 'foo'],
                   'B': ['one', 'one', 'two', 'three',
                         'two', 'two', 'one', 'three'],
                   'C': np.random.randn(8),
                   'D': np.random.randn(8)})
    
df

     A      B         C         D
0  foo    one -0.686562 -0.529086
1  bar    one -0.581670 -0.785279
2  foo    two  1.789586 -0.541180
3  bar  three  0.704334 -0.313629
4  foo    two  1.752017 -0.359660
5  bar    two -0.113411 -1.676184
6  foo    one  1.319374  0.446867
7  foo  three  2.000321  0.279283

In [0]:
#All bar's sum into A.at["bar"], all foo's sum into A.at["foo"]
df.groupby("A").sum()

            C         D
A
bar  0.009254 -2.775091
foo  6.174735 -0.703776

In [0]:
#Grouping multiple columns forms a hierarchical index
df.groupby(["A", "B"]).sum()

                  C         D
A   B
bar one   -0.581670 -0.785279
    three  0.704334 -0.313629
    two   -0.113411 -1.676184
foo one    0.632811 -0.082219
    three  2.000321  0.279283
    two    3.541603 -0.900840

# Reshaping

## Stack